chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/processor/usb_p32mx120f032b.h
PLIB_INLINE_API void PLIB_USB_OTG_VBusChargeEnable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_OTG_VBusChargeEnable_Default(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USB_OTG_VBusChargeDisable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_OTG_VBusChargeDisable_Default(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_USB_ExistsOTG_VbusCharge(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsOTG_VbusCharge_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_USB_OTG_VBusDischargeEnable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_OTG_VBusDischargeEnable_Default(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USB_OTG_VBusDischargeDisable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_OTG_VBusDischargeDisable_Default(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_USB_ExistsOTG_VbusDischarge(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsOTG_VbusDischarge_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_USB_ActivityPending(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ActivityPending_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_USB_ExistsActivityPending(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsActivityPending_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_USB_SleepGuardEnable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_SleepGuardEnable_Default(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USB_SleepGuardDisable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_SleepGuardDisable_Default(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_USB_ExistsSleepEntryGuard(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsSleepEntryGuard_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_USB_ModuleIsBusy(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ModuleIsBusy_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API bool PLIB_USB_ExistsModuleBusy(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsModuleBusy_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_USB_SuspendEnable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_SuspendEnable_Default(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USB_SuspendDisable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_SuspendDisable_Default(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_USB_ExistsSuspend(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsSuspend_Default(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_USB_Enable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_Enable_32Bit16Bit(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USB_Disable(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            USB_Disable_32Bit16Bit(index);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_USB_ExistsModulePower(USB_MODULE_ID index)
{
    switch (index) {
        case USB_ID_1 :
            return USB_ExistsModulePower_32Bit16Bit(index);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

PLIB_INLINE_API void PLIB_USB_InterruptFlagSet(USB_MODULE_ID index, USB_INTERRUPTS interruptFlag)
{
    switch (index) {
        case USB_ID_1 :
            USB_InterruptFlagSet_Default(index, interruptFlag);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API void PLIB_USB_InterruptFlagClear(USB_MODULE_ID index, USB_INTERRUPTS interruptFlag)
{
    switch (index) {
        case USB_ID_1 :
            USB_InterruptFlagClear_Default(index, interruptFlag);
            break;
        case USB_NUMBER_OF_MODULES :
        default :
            break;
    }
}

PLIB_INLINE_API bool PLIB_USB_InterruptFlagGet(USB_MODULE_ID index, USB_INTERRUPTS interruptFlag)
{
    switch (index) {
        case USB_ID_1 :
            return USB_InterruptFlagGet_Default(index, interruptFlag);
        case USB_NUMBER_OF_MODULES :
        default :
            return (bool)0;
    }
}

